evaluation/ycsb_pm_results/redis/Runf/Run3
127.0.0.1
[OVERALL], RunTime(ms), 740069
[OVERALL], Throughput(ops/sec), 13512.253587165522
[TOTAL_GCS_G1_Young_Generation], Count, 47
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 118
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.015944459232855313
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 47
[TOTAL_GC_TIME], Time(ms), 118
[TOTAL_GC_TIME_%], Time(%), 0.015944459232855313
[READ], Operations, 10000000
[READ], AverageLatency(us), 48.7907564
[READ], MinLatency(us), 15
[READ], MaxLatency(us), 1752063
[READ], 95thPercentileLatency(us), 54
[READ], 99thPercentileLatency(us), 64
[READ], Return=OK, 10000000
[READ-MODIFY-WRITE], Operations, 4999121
[READ-MODIFY-WRITE], AverageLatency(us), 95.08980538778717
[READ-MODIFY-WRITE], MinLatency(us), 30
[READ-MODIFY-WRITE], MaxLatency(us), 10071
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 102
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 113
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2643.0
[CLEANUP], MinLatency(us), 2642
[CLEANUP], MaxLatency(us), 2643
[CLEANUP], 95thPercentileLatency(us), 2643
[CLEANUP], 99thPercentileLatency(us), 2643
[UPDATE], Operations, 4999121
[UPDATE], AverageLatency(us), 44.9554753725705
[UPDATE], MinLatency(us), 14
[UPDATE], MaxLatency(us), 6843
[UPDATE], 95thPercentileLatency(us), 46
[UPDATE], 99thPercentileLatency(us), 54
[UPDATE], Return=OK, 4999121