evaluation/ycsb_pm_results/redis/Runf/Run4
127.0.0.1
[OVERALL], RunTime(ms), 734979
[OVERALL], Throughput(ops/sec), 13605.830914896887
[TOTAL_GCS_G1_Young_Generation], Count, 47
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 127
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.01727940526191905
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 47
[TOTAL_GC_TIME], Time(ms), 127
[TOTAL_GC_TIME_%], Time(%), 0.01727940526191905
[READ], Operations, 10000000
[READ], AverageLatency(us), 48.5200276
[READ], MinLatency(us), 18
[READ], MaxLatency(us), 10391
[READ], 95thPercentileLatency(us), 54
[READ], 99thPercentileLatency(us), 65
[READ], Return=OK, 10000000
[READ-MODIFY-WRITE], Operations, 5000554
[READ-MODIFY-WRITE], AverageLatency(us), 94.49134135937739
[READ-MODIFY-WRITE], MinLatency(us), 35
[READ-MODIFY-WRITE], MaxLatency(us), 11519
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 102
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 113
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4358.0
[CLEANUP], MinLatency(us), 4356
[CLEANUP], MaxLatency(us), 4359
[CLEANUP], 95thPercentileLatency(us), 4359
[CLEANUP], 99thPercentileLatency(us), 4359
[UPDATE], Operations, 5000554
[UPDATE], AverageLatency(us), 44.401709690566285
[UPDATE], MinLatency(us), 17
[UPDATE], MaxLatency(us), 8191
[UPDATE], 95thPercentileLatency(us), 46
[UPDATE], 99thPercentileLatency(us), 52
[UPDATE], Return=OK, 5000554