evaluation/ycsb_pm_results/redis/Runf/Run8
127.0.0.1
[OVERALL], RunTime(ms), 732153
[OVERALL], Throughput(ops/sec), 13658.347367285252
[TOTAL_GCS_G1_Young_Generation], Count, 47
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 129
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.017619268103797978
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 47
[TOTAL_GC_TIME], Time(ms), 129
[TOTAL_GC_TIME_%], Time(%), 0.017619268103797978
[READ], Operations, 10000000
[READ], AverageLatency(us), 48.0862917
[READ], MinLatency(us), 15
[READ], MaxLatency(us), 9207
[READ], 95thPercentileLatency(us), 53
[READ], 99thPercentileLatency(us), 57
[READ], Return=OK, 10000000
[READ-MODIFY-WRITE], Operations, 5000180
[READ-MODIFY-WRITE], AverageLatency(us), 94.3288631609262
[READ-MODIFY-WRITE], MinLatency(us), 30
[READ-MODIFY-WRITE], MaxLatency(us), 8191
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 101
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 107
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3033.0
[CLEANUP], MinLatency(us), 3032
[CLEANUP], MaxLatency(us), 3033
[CLEANUP], 95thPercentileLatency(us), 3033
[CLEANUP], 99thPercentileLatency(us), 3033
[UPDATE], Operations, 5000180
[UPDATE], AverageLatency(us), 44.75974164930062
[UPDATE], MinLatency(us), 14
[UPDATE], MaxLatency(us), 4647
[UPDATE], 95thPercentileLatency(us), 46
[UPDATE], 99thPercentileLatency(us), 52
[UPDATE], Return=OK, 5000180